import { useState } from "react";

function Content() {
  const [showMore1, setShowMore1] = useState(false);
  const [showMore2, setShowMore2] = useState(false);
  const [showMore3, setShowMore3] = useState(false);

  return (
    <div className="p-5 lg:px-25 lg:py-15 w-full overflow-x-hidden">
      <h2 className="text-2xl text-(--text-secondary) mt-5">
        وقتی احساسها به درد جسمی تبدیل میشوند
      </h2>
      <div className="mt-10  border-1 border-purple-800 rounded-xl shadow-[0_4px_20px_rgba(0,0,0,0.55)]">
        <p className="p-5 text-[20px]">
          دلیله شانه درد، گردن درد یا کمر درد هایه ما چیه؟
        </p>
        <span
          dir="rtl"
          className={`block text-justify p-5 leading-8 ${
            showMore1 ? "" : "max-h-[150px] overflow-hidden md:max-h-none"
          }`}
        >
          این حرفا مثل یه گلوله نخ میمونه که هی دارید میپیچید دورش، بزرگتر و
          بزرگتر میشه. تو ذهنتون دارید مدام حرف میزنید: »اگه اون اتفاق
          نمیافتاد... اگه فالنی اون کارو نمیکرد...« و ظاهرش هم اینه که لبخندی
          میزنید و با دیگران خوشوبشی میکنید. وقتی این چیزا تکرار میشه، بارها
          تکرار میشه، به قول آقای وندرکوک تو اون کتاب مشهورش »بدن هرگز فراموش
          نمیکنه«، این حرفا، این عصبی شدنه و استرسه یه جورایی وارد یکی از اعضای
          بدن میشه. باری میخوایم بلند کنیم؛ اگه یه زنبیل سبک باشه با دست میگیرم،
          اگه بار سنگین باشه کولم میذارم یا پشتم میذارم. حاال این بار مسئولیت،
          بار مالی، بار خانواده، سبکه یا سنگینه؟ کجای بدنتون این بار رو بلند
          میکنید؟ بسته به اینکه این بار رو کجا بذارید، قسمتی از اسکلت بدنتون
          مشکلدار میشه. اگه رو سرتون بار رو گذاشتید، احتماال گردن یا شاید ستون
          فقرات. ببینید کجای بدنتون بار میذارید و کجای بدنتون دچار مشکلی شده.
          حاال میخوام این بار کمتر بشه. خب اوالً باید حواسم باشه که ببین این بار
          فیزیکی نیستا! این بارو نمیذاری پشتتا! بار رو سرت نمیذاریا! این مالیه،
          پوله، تو کارتم مجازیه، پس این بار )فیزیکی( نیست. بعد بگردید ببینید چه
          موانع ذهنیای دارید که االن بیپولید. برید ببینید چه باورایی پشتشه و چه
          خاطراتی پشت اون باورهاست. خاطرات رو خنثی کنید. اصل EFT( ایافتی( اینه
          که خاطرات رو خنثی کنید.
        </span>
        <button
          onClick={() => setShowMore1(!showMore1)}
          className="mx-5 mb-5 mt-2 text-purple-600 hover:text-purple-800 font-medium md:hidden"
        >
          {showMore1 ? "بستن مطلب" : "ادامه مطلب..."}
        </button>
      </div>
      <div className="mt-10  border-1 border-purple-800 rounded-xl shadow-[0_4px_20px_rgba(0,0,0,0.55)]">
        <p className="p-5 text-[20px]">
          ضربالمثلهایی که میتونه براتون درد بیاره
        </p>
        <span
          dir="rtl"
          className={`block text-justify p-5 leading-8 ${
            showMore2 ? "" : "max-h-[150px] overflow-hidden md:max-h-none"
          }`}
        >
          پشتش رو شکسته بود. این واقعیه؛ یه آقایی پسرش رو در یه تصادف از دست داد
          و مدت کوتاهی بعدش یکی از مهرههای ستون فقراتش شکست. تحتاللفظیه دیگه!
          »بشکنه این دست که نمک نداره«. واقعاً اینو دیدم، کسی دستش به قدری درد
          میکرد، در حد این که حتی یه دفترچه نمیتونست بلند کنه، برای اینکه به یه
          کسی کمک کرده بود، اونم حقشو ضایع کرده بود، تهشم هی میگفت »بشکنه این
          دست که نمک نداره«. حاال شما از چه اصطالحاتی استفاده میکنید در مورد
          اعضای بدنتون؟ با همه اینا کار داریم. »قلبمو به درد آورده«، »قلبمو
          شکسته«، خب استفاده مداوم ازین ضربالمثلها مشکل قلبی ایجاد میکنه، میتونه
          به معنی مجازی باشه، اما وقتی ما به دفعات میگیم که »نمیخوام این چیزا رو
          ببینم« )حاال این چیزا ممکنه یه آدم باشه، ممکنه شرایط جامعه باشه،
          هرچی(، خب نمیبینید دیگه! چشم یواش یواش ضعیف میشه. تلقینه دیگه، یه جور
          تلقینه. »جز جیگر بزنی«، »جیگرمو کباب کرده«، خب دارید تلقین میکنید که
          کبد درگیر بشه. پس حواستون باشه که چه اصطالحی دارید استفاده میکنید،
          برای اینکه دیگرانم بتونن استفاده کنن.
        </span>
        <button
          onClick={() => setShowMore2(!showMore2)}
          className="mx-5 mb-5 mt-2 text-purple-600 hover:text-purple-800 font-medium md:hidden"
        >
          {showMore2 ? "بستن مطلب" : "ادامه مطلب..."}
        </button>
      </div>
      <div className="mt-10  border-1 border-purple-800 rounded-xl shadow-[0_4px_20px_rgba(0,0,0,0.55)]">
        <p className="p-5 text-[20px]">صدای ترقه و خاطره جنگ</p>
        <span
          dir="rtl"
          className={`block text-justify p-5 leading-8 ${
            showMore3 ? "" : "max-h-[150px] overflow-hidden md:max-h-none"
          }`}
        >
          <p className="text-gray-600">
            این قسمت رو داریم از تجربیات آقای فروغمند و به زبان خود آقای فروغمند
            نقل میکنیم:
          </p>
          لایو اینستاگرام داشتم، همزمان جوونای این محل داشتن ترقه در میکردن.
          صدای ترقه میومد. همین که گفتم من چند لحظه سکوت میکنم تا این صدای
          ترقهها تموم بشه، برام کامنت گذاشتن که »وای من یاد جنگ افتادم! تو چقدر
          راحت نشستی... تداعی شد برام صحنههای جنگ، االن احساس میکنم دوباره دارن
          میزنن« و از اینجور چیزا. 2 گاهی احساس ناشی از یه خاطرات هیچوقت برطرف
          نمیشه. هر چقدر هم که زمان ازش بگذره انگار که همین تازگیها اتفاق
          افتاده. یه چیز ساده مثل صدای ترقه، یه نور شدید، یا یه بوی سوختگی
          میتونه برای ما یه خاطره خیلی سخت و شاید حتی وحشتناک رو تداعی کنه. با
          EFT میشه نیش احساسی اون خاطره رو جوری برطرف کرد که وقتی یادش میفتیم
          فقط بگیم یه موضوع بد بود، یه اتفاق بد بود، کاش که اتفاق نمیافتاد؛ در
          همین حد. و به زندگیمون ادامه بدیم با اعصاب راحتتر.
        </span>
        <button
          onClick={() => setShowMore3(!showMore3)}
          className="mx-5 mb-5 mt-2 text-purple-600 hover:text-purple-800 font-medium md:hidden"
        >
          {showMore3 ? "بستن مطلب" : "ادامه مطلب..."}
        </button>
      </div>
    </div>
  );
}

export default Content;
